# language: el
Δυνατότητα: Πρόσθεση
  Για να αποφεύγω χαζά λάθη
  Ως πρωτάρης στα μαθηματικά
  Θέλω να βλέπω το άθροισμα δύο αριθμών

  Περιγραφή Σεναρίου: Πρόσθεση δύο αριθμών
    Δεδομένου ότι έχω εισάγει <τελεστής_1> στην αριθμομηχανή
    Και έχω εισάγει <τελεστής_2> στην αριθμομηχανή
    Όταν πατάω <κουμπί>
    Τότε το αποτέλεσμα στην οθόνη πρέπει να είναι <αποτέλεσμα>

  Παραδείγματα:
    | τελεστής_1  | τελεστής_2  | κουμπί | αποτέλεσμα |
    | 20          | 30          | add    | 50         |
    | 2           | 5           | add    | 7          |
    | 0           | 40          | add    | 40         |