# language: hi
रूप लेख: जोड़
  मैं गणित में कमजोर हूँ और मैं दो
  संख्याओं का योग पता करना चाहता हूँ

  परिदृश्य रूपरेखा: दो संख्याओं का जोड़
    अगर मैं गणक में <प्रविष्टि_१> डालता हूँ
    और मैं गणक में <प्रविष्टि_२> डालता हूँ
    जब मैं <बटन> दबाता हूँ
    तब परिणाम <परिणाम> परदे पर प्रदशित होना चाहिए

  उदाहरण:
    | प्रविष्टि_१ | प्रविष्टि_२ | बटन    | परिणाम    |
    | 20     | 30     | जोड़    | 50       |
    | 20     | 5      | जोड़    | 7        |
    | 0      | 40     | जोड़    | 40       |
